{"Task Number": 1, "Task Description": "The user is looking for new book recommendations based on their preferred genres, favorite authors, and previously enjoyed books or series. The assistant should suggest titles that align with these preferences.", "User Intent": "Find new book recommendations tailored to your preferred genres, favorite authors, and books or series you've enjoyed in the past.", "Task Goal": "The user receives a personalized list of book recommendations that match their reading interests and preferences.", "Relevant Affinity Types": ["Genre", "Favorite Authors", "Favorite Books", "Favorite Book Series"]}
{"Task Number": 2, "Task Description": "The user is planning to start a new book series and wants suggestions for highly-rated series within their preferred genre. The assistant should provide options based on the user's genre preferences and reading format (e.g., physical books, ebooks, audiobooks).", "User Intent": "Get recommendations for popular and highly-rated book series within your preferred genre and in your preferred reading format (e.g., physical, ebook, audiobook).", "Task Goal": "The user receives a curated list of acclaimed book series options that match their genre and format preferences.", "Relevant Affinity Types": ["Genre", "Reading Format"]}
{"Task Number": 3, "Task Description": "The user is looking for a quick, engaging read to enjoy during their limited free time. The assistant should recommend short books or novellas based on the user's genre preferences and typical reading frequency or available reading time.", "User Intent": "Find recommendations for short, engaging books or novellas that fit your preferred genres and the amount of time you typically have available for reading.", "Task Goal": "The user receives suggestions for compelling yet concise reading options tailored to their interests and reading habits.", "Relevant Affinity Types": ["Genre", "Reading Time Preference", "Reading Frequency"]}
{"Task Number": 4, "Task Description": "The user is interested in exploring a new genre and wants guidance on popular titles or authors to start with. The assistant should provide recommendations based on the user's existing genre preferences and reading format.", "User Intent": "Discover popular titles or authors to help you explore a new genre, based on the genres you currently enjoy and your preferred reading format.", "Task Goal": "The user receives a curated list of well-regarded books or authors within a new genre, making it easier to venture into unfamiliar territory.", "Relevant Affinity Types": ["Genre", "Reading Format"]}
{"Task Number": 5, "Task Description": "The user is looking for book recommendations suitable for a long travel period, such as a cross-country trip or extended vacation. The assistant should suggest engaging, lengthy books or series based on the user's genre preferences and typical reading frequency.", "User Intent": "Find recommendations for engaging, lengthy books or book series that would be suitable for an upcoming extended travel period, based on your preferred genres and typical reading habits.", "Task Goal": "The user receives suggestions for immersive, substantial reading material tailored to their interests and reading habits, ideal for a long journey.", "Relevant Affinity Types": ["Genre", "Reading Frequency"]}
