{"Task Number": 1, "Task Description": "The user is looking for a restaurant to visit for a special occasion. The assistant should provide personalized recommendations based on the user's preferred cuisine type, dietary restrictions (if any), desired ambiance or atmosphere, and budget range.", "User Intent": "Find a restaurant recommendation for a special occasion that aligns with your preferred cuisine, dietary needs or restrictions, desired ambiance, and budget range.", "Task Goal": "The user receives a curated list of restaurant options that match their preferences, making it easier to choose a suitable venue for their special occasion.", "Relevant Affinity Types": ["Cuisine Preference", "Dietary Restrictions", "Ambiance Preference", "Price Range"]}
{"Task Number": 2, "Task Description": "The user is visiting a new city and wants to explore the local food scene. The assistant should suggest popular or highly-rated restaurants in the area, considering the user's cuisine preferences and any dietary restrictions they may have.", "User Intent": "Discover popular or highly-rated restaurants in a new city you're visiting, tailored to your preferred cuisine types and any dietary restrictions you have.", "Task Goal": "The user receives a list of recommended restaurants in the new city that align with their culinary tastes and dietary needs, helping them explore the local food culture.", "Relevant Affinity Types": ["Cuisine Preference", "Dietary Restrictions"]}
{"Task Number": 3, "Task Description": "The user is planning a group outing and needs to find a restaurant that can accommodate diverse dietary needs and preferences within the group. The assistant should provide options that cater to various cuisine preferences, dietary restrictions, and budget ranges.", "User Intent": "Find a restaurant option suitable for a group outing that can accommodate diverse dietary needs and preferences, including different cuisine preferences, dietary restrictions, and budget ranges within the group.", "Task Goal": "The user receives a shortlist of restaurant options that can cater to the group's varied dietary needs and preferences, making it easier to plan an enjoyable outing for everyone.", "Relevant Affinity Types": ["Cuisine Preference", "Dietary Restrictions", "Price Range"]}
{"Task Number": 4, "Task Description": "The user is seeking a cozy, intimate restaurant for a romantic dinner. The assistant should recommend options that match the user's preferred cuisine type and ambiance preferences, such as dimly lit, quiet, or upscale settings.", "User Intent": "Find a cozy, intimate restaurant recommendation for a romantic dinner that aligns with your preferred cuisine type and desired ambiance or atmosphere.", "Task Goal": "The user receives a curated list of romantic restaurant options that match their cuisine preferences and desired ambiance, helping them plan a memorable evening.", "Relevant Affinity Types": ["Cuisine Preference", "Ambiance Preference"]}
