{"Task Number": 1, "Task Description": "The user wants to book a flight for an upcoming trip and needs assistance finding options that fit their preferences for airline, seat class, layover duration, and departure time.", "User Intent": "Find and book a flight for your upcoming trip, taking into account your preferred airline, desired seat class, layover preferences, and ideal departure time.", "Task Goal": "The user successfully books a flight that aligns with their stated preferences across multiple affinity types.", "Relevant Affinity Types": ["Preferred Airline", "Seat Class Preference", "Layover Preference", "Departure Time Preference"]}
{"Task Number": 2, "Task Description": "The user is looking for the most affordable flight options for a specific travel date and route, while still considering their seating preferences and any airline loyalty programs they belong to.", "User Intent": "Discover the most budget-friendly flight options for your desired travel date and route, while factoring in your seating preferences and any airline loyalty programs you're a part of.", "Task Goal": "The user finds a cost-effective flight that balances their budget with their seating and airline preferences.", "Relevant Affinity Types": ["Seat Preference", "Preferred Airline"]}
{"Task Number": 3, "Task Description": "The user needs to change an existing flight booking due to updated travel plans and wants assistance finding alternative options that minimize layover time and align with their preferred airline and seat preferences.", "User Intent": "Modify your existing flight booking to accommodate your updated travel plans, with a focus on minimizing layover time while still considering your preferred airline and seat preferences.", "Task Goal": "The user successfully changes their flight booking to a new itinerary that better suits their needs and preferences.", "Relevant Affinity Types": ["Layover Preference", "Preferred Airline", "Seat Preference"]}
{"Task Number": 4, "Task Description": "The user is planning a multi-city trip and needs help finding a combination of flights that connect their desired destinations while taking into account their preferred airlines, layover duration, and seat class.", "User Intent": "Plan a multi-city trip by finding a combination of flights that connect your desired destinations, while considering your preferred airlines, layover duration preferences, and desired seat class.", "Task Goal": "The user receives a comprehensive itinerary with a combination of flights that meets their multi-city travel needs and aligns with their stated preferences.", "Relevant Affinity Types": ["Preferred Airline", "Layover Preference", "Seat Class Preference"]}
{"Task Number": 5, "Task Description": "The user is looking for last-minute flight deals for a specific travel date and destination, prioritizing their preferred airline and seat preferences over departure time or layover duration.", "User Intent": "Find last-minute flight deals for your desired travel date and destination, prioritizing your preferred airline and seat preferences over departure time or layover duration.", "Task Goal": "The user secures a last-minute flight deal that meets their destination and travel date requirements while aligning with their airline and seat preferences.", "Relevant Affinity Types": ["Preferred Airline", "Seat Preference"]}
