{"Task Number": 1, "Task Description": "The user wants to find new shows or movies to watch based on their preferred genres, favorite actors/directors, and viewing platform. The assistant should provide tailored recommendations that match these preferences.", "User Intent": "Discover new shows or movies that align with your preferred genres, favorite actors/directors, and preferred viewing platform.", "Task Goal": "The user receives a curated list of personalized media recommendations to explore based on their stated preferences.", "Relevant Affinity Types": ["Preferred Genres", "Favorite Actors and Directors", "Viewing Platform Preference"]}
{"Task Number": 2, "Task Description": "The user is looking for a specific movie or show to rent or purchase but can't recall the exact title. The assistant should help identify the desired media based on details like genre, plot, cast, or other distinguishing factors provided by the user.", "User Intent": "Find and obtain a specific movie or show you want to watch, based on details like genre, plot, cast, or other distinguishing factors you can provide.", "Task Goal": "The user successfully identifies and locates the desired movie or show for rental or purchase.", "Relevant Affinity Types": ["Preferred Genres", "Favorite Actors and Directors", "Favorite Media"]}
{"Task Number": 3, "Task Description": "The user wants to stay updated on new releases or upcoming seasons of their favorite shows. The assistant should set up notifications or provide a watchlist for the user's preferred media.", "User Intent": "Stay informed about new releases or upcoming seasons of your favorite shows by setting up notifications or a watchlist.", "Task Goal": "The user has a personalized system in place to receive timely updates on new content related to their media preferences.", "Relevant Affinity Types": ["Favorite Media"]}
{"Task Number": 4, "Task Description": "The user is looking for family-friendly movie or show recommendations suitable for co-viewing with children of a specific age group. The assistant should suggest options that are age-appropriate and align with the user's genre preferences.", "User Intent": "Find family-friendly movie or show recommendations suitable for co-viewing with children of a specific age group, while considering your preferred genres.", "Task Goal": "The user receives a list of age-appropriate media recommendations that balance family-friendly content with their personal genre interests.", "Relevant Affinity Types": ["Preferred Genres", "Viewing Platform Preference"]}
{"Task Number": 5, "Task Description": "The user wants to explore media from a specific country or culture, perhaps to learn more about that region or practice a language. The assistant should recommend shows, movies, or documentaries that provide cultural exposure aligned with the user's interests.", "User Intent": "Discover shows, movies, or documentaries that offer exposure to a specific country or culture, aligning with your interests and preferences.", "Task Goal": "The user receives a curated selection of media that provides cultural insights while catering to their personal tastes and affinities.", "Relevant Affinity Types": ["Preferred Genres", "Favorite Media"]}
